docs/posts/2015-12-22-prayer-for-the-fourth-sunday-of-advent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Fourth Sunday of Advent</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Fourth Sunday of Advent</h1>
<p class="subtitle" role="doc-subtitle">Dec 22, 2015</p>
</header><p>
Holy God,
</p>

<p>
When a new emperor<br>
took the throne,<br>
messengers were sent<br>
to the rich and powerful<br>
to deliver &ldquo;glad tidings&rdquo;<br>
of Caesar, who was called<br>
&ldquo;savior and lord&rdquo; and<br>
promised to bring<br>
peace to the empire<br>
through the power<br>
of his vast riches<br>
and his mighty armies.
</p>

<p>
But when the King was born,<br>
messengers from God were sent,<br>
not to the rich and powerful,<br>
but to those too poor<br>
to be noticed by the empire.
</p>

<p>
And for the first time,<br>
they heard glad tidings<br>
of good news, that peace<br>
would come to the world,<br>
not by the power of force<br>
but through the power of love.
</p>

<p>
Look within my heart, Lord,<br>
this Christmas season.
</p>

<p>
May what you find there<br>
reflect the humility<br>
of the ones to whom<br>
your messengers<br>
were first sent.
</p>

<p>
And forgive me for when<br>
I&rsquo;ve turned the celebration<br>
of your birth into something<br>
that served the empire<br>
more than it did your Kingdom.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org8be81d3">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
